# Shape Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Control..::..Shape Property
Control Class See Also
---
The control shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ControlShape Shape { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Shape As ControlShape
	Get
```

Visual C++
---
```text
public:
property ControlShape Shape {
	ControlShape get ();
}
```

# See Also
Control Class
Autodesk.Revit.DB Namespace